# Data Preprocessing

In [27]:
import pandas as pd
from sklearn.model_selection import train_test_split

## Data Joining

In [28]:
titanic = pd.read_csv('titanic_new.csv')

In [29]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [30]:
titanic.shape

(1309, 12)

(1) buat dataframe a: titanic kolom 1-6, row 1-600  
(2) buat dataframe b: titanic kolom 7-12 + PassengerId, row 1-600  
(3) buat dataframe c: titanic semua kolom, row 601 sampai akhir  
(4) gabungkan a dan b secara horizontal menggunakan kolom 'PassengerId' sebagai acuan, namakan ab (gunakan fungsi merge)   
(5) gabungkanlah ab dan c secara vertikal, namakan abc  
(6) print .head() dan .shape dari abc

In [31]:
a = titanic.iloc[:600, 0:6]
b = titanic.loc[:599, ['PassengerId'] + list(titanic.columns)[6:]]

In [32]:
a.shape

(600, 6)

In [33]:
b.shape

(600, 7)

In [34]:
b.tail()

     PassengerId  SibSp  Parch    Ticket     Fare Cabin Embarked
595          596      1      1    345773  24.1500   NaN        S
596          597      0      0    248727  33.0000   NaN        S
597          598      0      0      LINE   0.0000   NaN        S
598          599      0      0      2664   7.2250   NaN        C
599          600      1      0  PC 17485  56.9292   A20        C

In [35]:
a.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age
595,596,0,3,"Van Impe, Mr. Jean Baptiste",male,36.0
596,597,1,2,"Leitch, Miss. Jessie Wills",female,NaN
597,598,0,3,"Johnson, Mr. Alfred",male,49.0
598,599,0,3,"Boulos, Mr. Hanna",male,NaN
599,600,1,1,"Duff Gordon, Sir. Cosmo Edmund (""Mr Morgan"")",male,49.0

In [36]:
c = titanic.iloc[600:]

In [37]:
ab = pd.merge(a, b, on='PassengerId')
ab

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
595,596,0,3,"Van Impe, Mr. Jean Baptiste",male,36.0,1,1,345773,24.1500,NaN,S
596,597,1,2,"Leitch, Miss. Jessie Wills",female,NaN,0,0,248727,33.0000,NaN,S
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0000,NaN,S
598,599,0,3,"Boulos, Mr. Hanna",male,NaN,0,0,2664,7.2250,NaN,C
599,600,1,1,"Duff Gordon, Sir. Cosmo Edmund (""Mr Morgan"")",male,49.0,1,0,PC 17485,56.9292,A20,C

In [38]:
abc = pd.concat([ab, c], axis=0)
print(abc.head())
print(abc.shape)

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
(1309, 12)

## Train Test Split

1. pisahkan X (fitur prediktor) dan y (label) dari titanic  
2. lakukan train_test_split (test_size = 0.2, stratify = y) yang menghasilkan X_train, X_test, y_train, y_test  
3. print .head(), type(), dan .shape dari masing-masing variabel

In [39]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [40]:
X = titanic.drop('Survived', axis=1)
y = titanic['Survived']

In [41]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, stratify=y, random_state=42)

In [42]:
for set in [X_train, X_test, y_train, y_test]:
    print(set.head())
    print(type(set))
    print(set.shape)
    print('---')

      PassengerId  Pclass                                               Name  \
1021         1022       3                            Spinner, Mr. Henry John
318           319       1                           Wick, Miss. Mary Natalie
924           925       3  Johnston, Mrs. Andrew G (Elizabeth Lily" Watson)"
652           653       3                     Kalvik, Mr. Johannes Halvorsen
1189         1190       1                         Loring, Mr. Joseph Holland

         Sex   Age  SibSp  Parch           Ticket      Fare Cabin Embarked
1021    male  32.0      0      0  STON/OQ. 369943    8.0500   NaN        S
318   female  31.0      0      2            36928  164.8667    C7        S
924   female   NaN      1      2       W./C. 6607   23.4500   NaN        S
652     male  21.0      0      0             8475    8.4333   NaN        S
1189    male  30.0      0      0           113801   45.5000   NaN        S
<class 'pandas.core.frame.DataFrame'>
(1047, 11)
---
      PassengerId  Pclass                         Name     Sex   Age  SibSp  \
950           951       1  Chaudanson, Miss. Victorine  female  36.0      0
811           812       3            Lester, Mr. James    male  39.0      0
475           476       1  Clifford, Mr. George Quincy    male   NaN      0
1136         1137       1      Kenyon, Mr. Frederick R    male  41.0      1
137           138       1  Futrelle, Mr. Jacques Heath    male  37.0      1

      Parch     Ticket      Fare Cabin Embarked
950       0   PC 17608  262.3750   B61        C
811       0  A/4 48871   24.1500   NaN        S
475       0     110465   52.0000   A14        S
1136      0      17464   51.8625   D21        S
137       0     113803   53.1000  C123        S
<class 'pandas.core.frame.DataFrame'>
(262, 11)
---
1021    0
318     1
924     1
652     0
1189    0
Name: Survived, dtype: int64
<class 'pandas.core.series.Series'>
(1047,)
---
950     1
811     0
475     0
1136    0
137     0
Name: Survived, dtype: int64
<class 'pandas.core.series.Series'>
(262,)
---